{
    "content"    :"The traffic lights at the pedestian crossing started beeping as I was self conciously waiting, looking at an insect swimming on a little puddle that the previous night's rain had made. Upon hearing the sound I lifted my head and carefully stepped towards the path that would take me home that evening, like other similar evenings that have come before.</br></br>Half way through the path I came across a man who was desperately searching for something up in the trees. One possibility that I thought was that he was bird watching. This road I use to and from work every saturday and sunday is in part of the park lands in Adelaide. Green fields and trees cover the land on either side of the natural way.</br></br>A few different species of birds are always on the move, sometimes I see a flock of crows and the other times I see cockatoos. Colorful parrots are amongst the regular witnesses to my walk. I also see other birds that I dont even know names of. A brawl one morning, between a group of crows and the cockatoos for the territory on the field which serves them with underground insects for their morning breakfast was an unforgettable sight.</br></br>Oh! thats a little bit too much about the birds. Lets get back to the man and continue our story. As I got closer to him and smiled, he asked with a worried tone in his voice if I had seen a little cat that he had lost? First thing my tired mind imagined was of a helpless cat being taken away by an eagle. I told the man that I had not seen any cat around and curiously asked what sort of cat is it? A little cat, replied the man. After a brief silence I said I am sorry and would bring the cat to him if I found it further up the track.</br></br>I hurrieldy walked away from the scene towards home. A lot of questions left unanswered in my mind as I was walking. What if I had spent a few more minutes and helped that man look for the cat? What was it that stopped me from doing this? Is it that I thought I was too busy living my own life eventhough I am not. Or is it I hate cats. Whatever it is I hope he found his beloved little cat." ,
    "description":"Ketan Khanal of Nepal On-board shares an experience he encountered while walking back home from work one evening.",
    "fb_id":"1061182012"
}          